app/Http/Controllers/BuoiHocController.php

    public function index($id_lop_hoc)
    {
        $buoiHoc = BuoiHoc::where('id_lop_hoc', $id_lop_hoc)->get();

        if(count($buoiHoc) > 0) {
            $lopHoc = LopHoc::find($id_lop_hoc);
---
select * from `buoi_hocs` where `id_lop_hoc` = '5'
select * from `lop_hocs` where `lop_hocs`.`id` = '5' limit 1

    public function getData($id_lop_hoc)
    {
        $list = BuoiHoc::where('id_lop_hoc', $id_lop_hoc)
                        ->join('nhan_viens', 'buoi_hocs.id_nhan_vien_day', 'nhan_viens.id')
                        ->join('lop_hocs', 'lop_hocs.id', 'buoi_hocs.id_lop_hoc')
                        ->select('buoi_hocs.*', 'nhan_viens.ho_va_ten', 'lop_hocs.so_thang_hoc', 'lop_hocs.so_buoi_trong_thang',
                                    DB::raw("DATE_FORMAT(buoi_hocs.gio_bat_dau, '%d-%m-%Y %H:%i:%s') AS bat_dau"),
                                    DB::raw("DATE_FORMAT(buoi_hocs.gio_ket_thuc, '%d-%m-%Y %H:%i:%s') AS ket_thuc"),
                                    DB::raw("DATE_FORMAT(buoi_hocs.gio_bat_dau, '%Y-%m-%d') AS start"),
                                    DB::raw("DATE_FORMAT(buoi_hocs.gio_ket_thuc, '%d-%m-%Y') AS end"),
                        )
                        ->orderBy('buoi_hocs.thu_tu_buoi_khoa_hoc')
                        ->get();
        $data_thang_hoc = BuoiHoc::where('id_lop_hoc', $id_lop_hoc)
                                ->join('lop_hocs', 'lop_hocs.id', 'buoi_hocs.id_lop_hoc')
                                ->select('buoi_hocs.id_lop_hoc', 'lop_hocs.ten_lop_hoc', 'lop_hocs.so_thang_hoc', 'lop_hocs.so_buoi_trong_thang')
                                ->first();
---
select `buoi_hocs`.*, `nhan_viens`.`ho_va_ten`, DATE_FORMAT(buoi_hocs.gio_bat_dau, '%d-%m-%Y %H:%i:%s') AS bat_dau, DATE_FORMAT(buoi_hocs.gio_ket_thuc, '%d-%m-%Y %H:%i:%s') AS ket_thuc from `buoi_hocs` inner join `nhan_viens` on `buoi_hocs`.`id_nhan_vien_day` = `nhan_viens`.`id` where `id_lop_hoc` = '5' order by `buoi_hocs`.`thu_tu_buoi_khoa_hoc` asc
select `buoi_hocs`.*, `nhan_viens`.`ho_va_ten`, DATE_FORMAT(buoi_hocs.gio_bat_dau, '%d-%m-%Y %H:%i:%s') AS bat_dau, DATE_FORMAT(buoi_hocs.gio_ket_thuc, '%d-%m-%Y %H:%i:%s') AS ket_thuc from `buoi_hocs` inner join `nhan_viens` on `buoi_hocs`.`id_nhan_vien_day` = `nhan_viens`.`id` where `id_lop_hoc` = '5' order by `buoi_hocs`.`id` asc