app/Http/Controllers/HocVienController.php

select * from `nhan_viens`
---
    public function index()
    {
        $lopDangKy = LopHoc::where('is_mo_dang_ky', 1)->get();
        $nhanVien = NhanVien::get();