app/Http/Controllers/KhoaHocController.php

select * from `khoa_hocs`
---
    public function getData()
    {
        $data = KhoaHoc::all();