app/Http/Controllers/LichHocController.php

select * from `buoi_hocs` where `buoi_hocs`.`id` = '1' limit 1
select * from `hoc_vien_lop_hocs` where `id_lop_hoc` = 5 and `is_hoc_vien` = 1
select * from `lich_hocs` where `id_hoc_vien` = 1 and `id_buoi_hoc` = '1' limit 1
insert into `lich_hocs` (`id_buoi_hoc`, `id_hoc_vien`, `tinh_trang`, `updated_at`, `created_at`) values ('1', 1, 0, '2023-01-13 10:37:45', '2023-01-13 10:37:45')
---
    public function hocVienBuoiHoc($id_buoi_hoc)
    {
        $buoiHoc = BuoiHoc::find($id_buoi_hoc);
        if(!$buoiHoc) {
            return response()->json([
                'status'    => 0
            ]);
        }

        $hocVien = HocVienLopHoc::where('id_lop_hoc', $buoiHoc->id_lop_hoc)
                                ->where('is_hoc_vien', 1)
                                ->get();

        foreach($hocVien as $k => $v) {
            $check = LichHoc::where('id_hoc_vien', $v->id_hoc_vien)
                            ->where('id_buoi_hoc', $id_buoi_hoc)
                            ->first();
            if(!$check) {
                LichHoc::create([
                    'id_buoi_hoc'   => $id_buoi_hoc,
                    'id_hoc_vien'   => $v->id_hoc_vien,
                    'tinh_trang'    => 0,
                ]);