app/Http/Controllers/LichLamViecController.php

select * from `lich_lam_viecs` where `id_nhan_vien` = 1 and date(`ngay_lam_viec`) >= '2023-01-16' and date(`ngay_lam_viec`) <= '2023-01-22'
select * from `lich_lam_viecs` where date(`ngay_lam_viec`) >= '2023-01-16' and date(`ngay_lam_viec`) <= '2023-01-22'
---
    public function dataDangKyLichLamViec($type)
    {
        $type = 7 * $type;
        $user = Auth::guard('nhanVien')->user();
        // $user = auth('sanctum')->user();
        $now  = Carbon::today()->addDays($type);
        $thu  = $now->dayOfWeek == 0 ? 8 : $now->dayOfWeek + 1;
        $weekStartDate = Carbon::today()->addDays(9 + $type - $thu);
        $weekEndDate   = Carbon::today()->addDays(15 + $type - $thu);

        $days = [];
        $data = [];

        $lichLamViecUser = LichLamViec::where('id_nhan_vien', $user->id)
            ->whereDate('ngay_lam_viec', '>=', $weekStartDate)
            ->whereDate('ngay_lam_viec', '<=', $weekEndDate)
            ->get();

        $lichLamViecAll  = LichLamViec::whereDate('ngay_lam_viec', '>=', $weekStartDate)
            ->whereDate('ngay_lam_viec', '<=', $weekEndDate)
            ->get();