app/Http/Controllers/NhanVienController.php

select * from `nhan_viens`
---
    public function getData()
    {
        $data = NhanVien::all();